export const script1 = [
    '야, 너 양양 갔다 왔다며? 혼자서? 누구랑 갔어?',
    '언니들이랑 갔다 왔는데? 내가 어디 가는 건 자유잖아.', 
    '자유? 니가 그 동네가 어떤 동넨지 모르고 하는 소리네. 거기서 뭐했어?',
    '아니 뭐 어때서. 그냥 놀다 왔는데. 너무 오버하는 거 아니야?',
    '내가 오버? 나한테는 말도 안 하고 몰래 가고... 거기서 무슨 짓했는지 다 알아. 너 진짜 실망이다.',
    '하... 진짜 그만해. 내가 뭐 어떻게 했다고 이래. 너무 잘못됐어.',

    // '미안해, 내가 갑자기 화내서… 사실, 너 혼자서 양양 갔다고 하니까 좀 놀랐어. 내가 너무 예민했나 봐.',
    '응, 사실 나도 네가 걱정할 줄 알았어. 그래서 말할까 말까 하다가 그냥 편하게 다녀오자고 생각했어. 근데 이렇게까지 화낼 줄은 몰랐네.',

    // '내가 너무 오바했던 것 같아. 사실 네가 어디 가는 게 나한테는 큰 문제는 아닌데, 양양이라는 곳 자체가 왠지 모르게 신경 쓰였어. 그냥 어쩌면 내 불안 때문일지도 모르겠다.',
    '그런데, 네가 그렇게 생각하는 건 알겠는데, 난 그냥 언니들이랑 시간을 보내고 싶었어. 가끔은 나도 편하게 여행을 떠나고 싶은 거지. 네가 그런 내 마음을 좀 이해해 주면 좋겠어.',

    // '맞아. 나도 네가 자유롭게 지내고, 행복했으면 좋겠어. 근데 한편으론 내 자신감이 부족해서 네가 다른 곳에 있을 때 내가 소외되는 기분이 들 때가 있어. 그냥 괜히 불안해지는 거야.',
    '그랬구나… 네가 그런 생각을 하고 있었다니 몰랐어. 나한테 말 안 하고 혼자 그런 생각을 하고 있었던 거야?',

    // '응, 왠지 말을 하면 속 좁아 보일 것 같아서 그냥 꾹 참고 있었어. 그런데 그러다 보니까 괜히 혼자 상상만 커지고, 그래서 감정이 터졌나 봐. 내가 더 솔직하게 말했어야 했는데.',
    '알겠어, 이제 네 마음이 조금 이해가 간다. 다음엔 네가 그런 생각이 들면 미리 말해줘. 나도 네가 걱정하는 걸 알면 오히려 조심할 수 있으니까. 혼자서 계속 참지 말고.',

    // '나도 더 너한테 신경 쓸게. 고마워, 나한테 솔직히 말해줘서.',
    '나도 고마워. 다음부터는 나도 더 조심할게. 우리 서로 믿고 앞으로도 잘 이야기해 보자.'
];

export const script1_tip = [
    '',
    '',
    '',
    '',
    '',
    '',
    '이런.. 여자친구가 말도 안하고 양양을 갔다와서 화가 나겠어요. 그렇지만, 상대방을 계속 몰아붙인다면 상황이 나아지긴 힘들어 보입니다. 상황을 개선하기 위해 먼저 사과해보는 것은 어떨까요?',
    '좋아요, 먼저 사과하고 자신의 감정을 솔직히 표현했군요. 상대방이 방어적인 태도를 덜 취하게 만들 수 있습니다. 다만, 사과를 더욱 진정성 있게 보이려면 자신의 감정에 대해 더 구체적으로 설명해 주세요. 예를 들어, 놀란 이유가 무엇인지, 그 상황이 당신에게 어떤 느낌을 주었는지 구체적으로 표현하면 더 효과적입니다.',
    '\'불안 때문일지도 모르겠다\'는 표현을 통해 내면의 감정을 드러내는 것은 훌륭합니다. 그러나 ‘그냥’ 같은 단어가 자주 들어가면 진정성이 약해질 수 있습니다. 더 나아가 상대방이 혼란을 느낄 수 있어요. 그러니 이때는 불안감을 더 구체적으로 설명하면서 왜 그렇게 느꼈는지를 조금 더 구체적으로 표현해 보세요.',
    '상대방의 입장을 존중하는 말부터 시작하는 점이 훌륭합니다. 여기서 당신이 소외감을 느꼈다는 사실을 솔직히 말한 것도 매우 중요해요. 상대방이 이해하기 쉽게, 소외감을 느꼈을 때의 상황을 간단히 묘사해 보면 좋겠네요. 예를 들어, \'네가 여행을 가 있을 때 내가 혼자 남겨진 기분이 들더라\'와 같이 구체화하면 더 많은 공감을 이끌어낼 수 있습니다.',
    '\'속 좁아 보일 것 같았다\'고 솔직히 인정하는 태도는 상대방에게 신뢰를 줄 수 있습니다. 상대가 오해를 덜 하도록, 감정을 숨기지 않고 표현하는 것이 오히려 관계에 도움이 된다는 점을 강조하세요. 감정이 터지기 전에 작은 고민이라도 터놓고 말할 수 있다는 것을 상대방에게 안심시키는 게 좋습니다.',
    '상대방이 당신의 이야기를 받아들이고 있을 때, 다시 한 번 긍정적인 다짐을 표현하는 것은 좋습니다. 특히 ‘너를 믿어보려고 해’와 같은 구체적인 표현은 상대방에게 큰 안심을 줄 수 있습니다. 이 말을 한 뒤에는, 감정적인 신뢰를 쌓기 위해 상대방의 감정도 궁금해하는 질문을 추가로 던져 보세요. 예를 들어, \'혹시 내가 이 부분에서 더 잘했으면 하는 게 있을까?\'라고 물어보는 것도 좋은 방법입니다.',
    '마무리 대화로서 긍정적인 다짐을 교환한 점이 훌륭합니다. 이렇게 대화가 끝날 때는 작은 포옹이나 따뜻한 손길로 감정적 안정을 주면 상대방에게 더욱 진심이 전달됩니다. 또한, 향후 감정이 생길 때는 먼저 솔직하게 이야기하는 연습을 하는 것이 두 사람의 신뢰를 쌓는 데 도움이 될 거예요.'
]

export const script2 = [
    '',
    '',
]